In [1]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [2]:
import pandas as pd

In [4]:
df = pd.read_csv('gdrive/My Drive/Colab Notebooks/data/wfp_food_prices_database.csv')

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [5]:
df.head(1)

   adm0_id    adm0_name  adm1_id  ... mp_year  mp_price mp_commoditysource
0      1.0  Afghanistan      272  ...    2014      50.0                NaN

[1 rows x 18 columns]

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1560551 entries, 0 to 1560550
Data columns (total 18 columns):
 #   Column              Non-Null Count    Dtype
---  ------              --------------    -----
 0   adm0_id             1560551 non-null  float64
 1   adm0_name           1560551 non-null  object
 2   adm1_id             1560551 non-null  int64
 3   adm1_name           1089223 non-null  object
 4   mkt_id              1560551 non-null  int64
 5   mkt_name            1560551 non-null  object
 6   cm_id               1560551 non-null  int64
 7   cm_name             1560551 non-null  object
 8   cur_id              1560551 non-null  float64
 9   cur_name            1560551 non-null  object
 10  pt_id               1560551 non-null  int64
 11  pt_name             1560551 non-null  object
 12  um_id               1560551 non-null  int64
 13  um_name             1560551 non-null  object
 14  mp_month            1560551 non-null  int64
 15  mp_year             1560551 non-null  int64
 16  mp_price            1560551 non-null  float64
 17  mp_commoditysource  0 non-null        float64
dtypes: float64(4), int64(7), object(7)
memory usage: 214.3+ MB